//  -- 1 --
// У вас є масив об’єктів fruts, і в кожному з них є name
// Напишіть код, який перетворює їх в масив імен.

// const fruit = [
//   { id: 0, name: "Apple" },
//   { id: 1, name: "Tomat" },
//   { id: 2, name: "Cherry" },
//   { id: 3, name: "Orange" },
// ];

// fruit[0] = "Maria";
// fruit[1] = "Carry";
// fruit[2] = "Jessica";
// fruit[3] = "Laura";

// console.log(fruit);

// Для того, щоби перетворити масив фруктів в масив імен я переприсвоїв назви по id.
//  -- 2 --
//Виведіть парні числа від 2 до 10, використовуючи цикл for.

// for (let i = 1; i <= 10; i++) {
//   if (i % 2 === 1) continue;
//   console.log(i);
// }
// Для того, щоб отримати всі парні числа від 2 до 10 довелося 
//додати +1 до значення i. 
//  -- 3 --
// Замініть цикл "for" на "while"
// for (let i = 0; i < 5; i++) {
//     console.log( `цифра ${i}!` );
//   }

// let i = -1;

//   while (i < 4) {
//     i++;
//     console.log( `цифра ${i}!` );
//   }
 
   // Щоби відтворити результат циклу, тому що відповідав у консолі довелося значення
   // змінної i та значення умови знизити на 1. Тобто i = -1, а умова = i < 4.

//  -- 4 --
//Напишіть цикл, який пропонує prompt ввести число більше за 100.
//Якщо відвідувач введе менше число – попросити ввести ще раз, і так далі.
//Цикл повинен запитувати число доти, доки відвідувач не введе число,
// більше за 100, або не скасує ввід/введе порожній рядок.

//  let i = 100;


// while (true) {
//   let value = +prompt("Введіть число більше за 100");
//   if (value > 100) break;
//   if (!value) break;
//   else if (value < 100); 
//   alert ("Введіть інше число");
// }

// i += value;
    

//  -- 5 --
// Вирахуйте середній вік

// const girls = [
//   { age: 23, name: "Оля" },
//   { age: 29, name: "Аня" },
//   { age: 10, name: "Юля" },
//   { age: 20, name: "Катя" },
// ];

// let arr = [23, 29, 10, 20];

// let summ = arr.reduce((sum, item) => sum + item) /arr.length;
// console.log(summ);

// Середній вік дівчат = 20.5 років.